src/toir_cfe/src/Documents/торо_КорректировкаОстатковНаСкладах/торо_КорректировкаОстатковНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b7f6afca-f72d-4f17-af59-d6ff5a73d4b3">
  <name>торо_КорректировкаОстатковНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c26e6a66-348d-422b-b1b4-9e388d7281e8">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/проф_ТоварыНаСкладах/проф_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f2b5e01-847b-49d9-b668-ee6122445039">
  <name>проф_ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="78a7323c-7389-4599-84d6-fde6c3c3533d">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="9c39d63c-41cb-4486-a9ee-180052b85921">
    <name>КонтролироватьОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8289f7d9-fa0a-45f7-be0c-238495f87a84">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8df19511-0c7e-41a8-90eb-f953e351a534">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bd312888-71b8-45b3-bbf7-970c05bc2727">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="951359e6-820e-4f61-a602-16a239f40091">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="328ce0e5-8d0f-4315-8e53-033acc81fdd0">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/торо_КорректировкаОстатковНаСкладах/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, Режим)
	
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	Движения.проф_ТоварыНаСкладах.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаОстатковНаСкладах.Дата КАК Период,
	|	КорректировкаОстатковНаСкладах.Склад КАК Склад,
	|	ТоварыСНазначением.Номенклатура КАК Номенклатура,
	|	ТоварыСНазначением.Характеристика КАК Характеристика,
	|	СУММА(ТоварыСНазначением.Количество) КАК ВНаличии,
	|	ТоварыСНазначением.Серия КАК Серия,
	|	ТоварыСНазначением.Назначение КАК Назначение
	|ИЗ
	|	Документ.торо_КорректировкаОстатковНаСкладах КАК КорректировкаОстатковНаСкладах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_КорректировкаОстатковНаСкладах.проф_ТоварыСНазначением КАК ТоварыСНазначением
	|		ПО КорректировкаОстатковНаСкладах.Ссылка = ТоварыСНазначением.Ссылка
	|ГДЕ
	|	КорректировкаОстатковНаСкладах.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыСНазначением.Номенклатура,
	|	ТоварыСНазначением.Характеристика,
	|	ТоварыСНазначением.Серия,
	|	ТоварыСНазначением.Назначение,
	|	КорректировкаОстатковНаСкладах.Дата,
	|	КорректировкаОстатковНаСкладах.Склад";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	
	
	ДобавитьПриход = (ВидОперации = Перечисления.торо_ВидыОперацийКорректировкиОстатков.Оприходование);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если ДобавитьПриход Тогда
			Движение = Движения.проф_ТоварыНаСкладах.ДобавитьПриход();
		Иначе
			Движение = Движения.проф_ТоварыНаСкладах.ДобавитьРасход();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура проф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив();

	МассивВсехРеквизитов = Новый Массив();
	МассивРеквизитовОперации = Новый Массив();

	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
	МассивВсехРеквизитов,
	МассивРеквизитовОперации,
	МассивНепроверяемыхРеквизитов);

	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Характеристика");
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	МассивНепроверяемыхРеквизитов.Добавить("проф_ТоварыСНазначением.Характеристика");
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	#КонецВставки
	Если ФОИспользоватьХарактеристикиНоменклатуры = Истина тогда
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	КонецЕсли;

	ФОИспользоватьСерииНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия");
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	МассивНепроверяемыхРеквизитов.Добавить("проф_ТоварыСНазначением.Серия");
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	#КонецВставки
	Если ФОИспользоватьСерииНоменклатуры = Истина тогда
		НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект, Отказ, МассивНепроверяемыхРеквизитов);
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	Если Не Отказ Тогда
		Отказ = ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		проф_ОбщегоНазначенияВызовСервера.ПроверитьПризнакПодразделенияОрганизации(ЭтотОбъект["Подразделение"], Отказ);
	КонецЕсли;
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры

#КонецОбласти
